Alvin0523/mdp_stm32/src/selftest.c
/**
 * @file selftest.c
 * @brief Boot-time self-test sequence implementation.
 *
 * Trigger: hold PE0 (the onboard user button) down while the board resets
 * or powers on. Runs once, before the main loop, so it doesn't interfere
 * with normal operation or the host command fail-safe.
 *
 * Only PE8 is a GPIO-controllable LED on this board (confirmed against the
 * WHEELTEC resource-allocation PDF) - the LED1-LED4 silkscreen labels seen
 * on the schematic are hardwired power-rail/SWD indicators, not something
 * firmware can drive. So each test phase is signalled by a distinct PE8
 * blink count instead of separate LEDs.
 *
 * servo_set_angle() uses WHEELTEC's reference cubic PWM-vs-angle fit
 * (servo.c). Sign convention CONFIRMED ON PHYSICAL HARDWARE (2026-09-03):
 * positive = left, negative = right (matches REP-103). Operating clamps
 * (servo.h) are this unit's own hardware-measured real limits: left
 * 50-55deg chassis contact (2deg margin -> 48deg), right 26deg stall
 * (2deg margin -> 24deg) - see docs/stm32/tuning.md for the full decision
 * record, including how the LEFT/RIGHT labels got corrected after the
 * sign convention was pinned down (the sweeps were run before that).
 *
 * CURRENTLY IN RAW-PULSE STEERING CALIBRATION MODE (drive phases and the
 * both-extremes hold disabled; see selftest_run() and the RAW-PULSE
 * CALIBRATION block below):
 *   1 blink  = PHASE 1, straight line via the PID loop, steering centered at
 *              the measured 1490us
 *   2 blinks = CENTER TRIM (disabled - already done, 1490us)
 *   3 blinks = PHASE B, protractor measurement sweep (disabled by default)
 *
 * Every phase advances ONE STEP PER PE0 PRESS and displays the raw pulse
 * width, so measurement is self-paced. Any phase can be skipped by simply
 * not pressing PE0 - it times out and recenters. Watch and listen at every
 * step: the last pulse with clean, unobstructed motion is the real limit.
 * A servo stall is an audible buzz/whine with no visible motion; chassis
 * or linkage contact is the wheel/knuckle visibly binding or scraping
 * while the servo still strains. Stop at the last clean step - not the one
 * that stalled. Releasing the button for SELFTEST_CAL_STEP_TIMEOUT_MS
 * aborts and recenters, so nothing is left stalled unattended.
 *
 * Calibrate in MICROSECONDS, not in the "angle" the servo_set_angle*()
 * functions take - that unit is an input to WHEELTEC's unverified cubic
 * and its 800-2200us clamp is what previously made the right side
 * impossible to measure. Full reasoning at servo.h's servo_set_pulse_us().
 * The older angle-based sweeps (servo_sweep_range()/servo_sweep_left_fine()/
 * servo_sweep_right_fine()) are retained for reference only.
 *
 * NORMAL drive-test sequence (restore by uncommenting drive phases in
 * selftest_run()):
 *   1 blink = forward 1 wheel revolution
 *   2 blinks = backward 1 wheel revolution
 *   3 blinks = servo to LEFT max, hold, then RIGHT max, hold
 *   4 blinks = done
 *
 * Refusal (motor switch OFF) is a distinct standalone 5-blink pattern with
 * a different on/off timing (100ms/100ms vs. the phases' 150ms/150ms) -
 * not part of either numbered sequence above.
 */

#include "selftest.h"
#include "stm32f4xx_hal.h"
#include "motor.h"
#include "servo.h"
#include "button.h"
#include "encoder.h"
#include "oled.h"
#include <stdlib.h>
#include <stdio.h>

/* Ticks per wheel revolution: see docs/stm32/protocol.md /
 * mdp_hardware_bridge's kTicksPerWheelRev - sourced from WHEELTEC's vendor
 * reference firmware (EncoderMultiples * Hall_13 * HALL_30F). */
#define SELFTEST_TICKS_PER_REV 1560
#define SELFTEST_DRIVE_PCT     30
#define SELFTEST_DRIVE_TIMEOUT_MS 5000U /* safety: give up if wheels don't turn */

/* Servo sweep timing - see docs/stm32/control_loop.md ("Servo range").
 * Confirmed final per-side limits live in servo.h
 * (SERVO_ANGLE_MAX_LEFT_RAD/SERVO_ANGLE_MAX_RIGHT_RAD), not duplicated here.
 * Step size is defined in degrees purely because that's a more intuitive
 * unit for a human picking a sweep resolution - converted to radians once,
 * immediately, since servo_set_angle()/servo_set_angle_raw() take radians
 * (matching REP-103 / the rest of the stack, see servo.h). */
#define SELFTEST_SERVO_SWEEP_STEP_DEG   1.0f
#define SELFTEST_SERVO_SWEEP_STEP_RAD   (SELFTEST_SERVO_SWEEP_STEP_DEG * 3.14159265f / 180.0f)
/* Ranges start just under the CURRENT operating clamp (servo.h) and sweep
 * past it - the point is to find where the real mechanical lock/stall is,
 * which is confirmed further out than the current provisional clamp on at
 * least the right side. Still safe regardless of how far these go: the
 * cubic mapping's own hard PWM clamp (servo.c, SERVO_WT_PWM_MIN/MAX_US)
 * caps the actual pulse sent to WHEELTEC's own tested-safe bound no matter
 * what angle is requested here. */
/* LEFT = positive, RIGHT = negative - confirmed on physical hardware
 * (servo.h). These ranges/values are unchanged from the original sweeps;
 * only the LEFT/RIGHT labels were corrected after that confirmation (the
 * sweeps were run before the sign convention was pinned down - see
 * docs/stm32/tuning.md). */
#define SELFTEST_SERVO_LEFT_FINE_START_DEG  40.0f
#define SELFTEST_SERVO_LEFT_FINE_END_DEG    55.0f
#define SELFTEST_SERVO_LEFT_FINE_START_RAD  (SELFTEST_SERVO_LEFT_FINE_START_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_LEFT_FINE_END_RAD    (SELFTEST_SERVO_LEFT_FINE_END_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_RIGHT_FINE_START_DEG (-22.0f)
#define SELFTEST_SERVO_RIGHT_FINE_END_DEG   (-40.0f)
#define SELFTEST_SERVO_RIGHT_FINE_START_RAD (SELFTEST_SERVO_RIGHT_FINE_START_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_RIGHT_FINE_END_RAD   (SELFTEST_SERVO_RIGHT_FINE_END_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_SWEEP_HOLD_MS    1500U

/* Straight-line PID test: target wheel speed and run duration. 5 rad/s is
 * roughly 15% of MOTOR_MAX_WHEEL_RAD_S (34.56) - slow enough to stay
 * controllable indoors, fast enough that the PID is actually working. 4s is
 * long enough to see a curve develop; the 1-wheel-revolution drive phases
 * are far too short for that. */
#define SELFTEST_STRAIGHT_RAD_S 5.0f
#define SELFTEST_STRAIGHT_MS    4000U

static void blink_pe8(uint8_t times, uint32_t on_ms, uint32_t off_ms)
{
    for (uint8_t i = 0; i < times; i++) {
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8, GPIO_PIN_SET);
        HAL_Delay(on_ms);
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8, GPIO_PIN_RESET);
        HAL_Delay(off_ms);
    }
}

static void drive_ticks(int16_t pct, int32_t target_ticks)
{
    encoder_get_delta_a();
    encoder_get_delta_b();

    /* Track and stop each wheel independently - motors are never perfectly
     * matched, so averaging left+right (the old approach) could stop one
     * wheel short of a full revolution while overshooting the other. */
    int32_t accumulated_a = 0;
    int32_t accumulated_b = 0;
    uint8_t done_a = 0;
    uint8_t done_b = 0;
    uint32_t start_tick = HAL_GetTick();

    motor_set_speed(pct, pct);
    while (!done_a || !done_b) {
        if (!done_a) {
            accumulated_a += labs(encoder_get_delta_a());
            if (accumulated_a >= target_ticks) {
                done_a = 1;
            }
        }
        if (!done_b) {
            accumulated_b += labs(encoder_get_delta_b());
            if (accumulated_b >= target_ticks) {
                done_b = 1;
            }
        }
        motor_set_speed(done_a ? 0 : pct, done_b ? 0 : pct);

        if (HAL_GetTick() - start_tick > SELFTEST_DRIVE_TIMEOUT_MS) {
            break; /* wheels not turning (off ground / stuck?) - don't hang forever */
        }
        HAL_Delay(20);
    }
    motor_set_speed(0, 0);
    HAL_Delay(300); /* let it settle before the next phase */
}

