Alvin0523/mdp_stm32/src/selftest.c
/* Sweeps one range (both bounds in RADIANS, matching servo_set_angle()'s
 * unit) at SELFTEST_SERVO_SWEEP_STEP_RAD resolution. Direction is
 * auto-detected from start_rad vs end_rad - ascends if end_rad > start_rad,
 * descends otherwise. use_raw selects servo_set_angle_raw() (bypasses the
 * SERVO_ANGLE_MAX_LEFT/RIGHT_RAD operating clamp - calibration/measurement
 * only) vs. the normal clamped servo_set_angle() (safe for routine
 * self-test use). The OLED readout converts back to degrees purely for
 * human readability while watching/measuring - the underlying command and
 * comparison against a protractor is still whatever that degree number
 * represents, this is a display-only conversion. */
static void servo_sweep_range(float start_rad, float end_rad, const char *label, uint8_t use_raw)
{
    char buf[24];
    float step = (end_rad >= start_rad) ? SELFTEST_SERVO_SWEEP_STEP_RAD : -SELFTEST_SERVO_SWEEP_STEP_RAD;

    oled_show_string_8x16_offset(1, 0, label);
    HAL_Delay(500);

    for (float angle = start_rad;
         (step > 0.0f) ? (angle <= end_rad + 0.0002f) : (angle >= end_rad - 0.0002f);
         angle += step) {
        if (use_raw) {
            servo_set_angle_raw(angle);
        } else {
            servo_set_angle(angle);
        }
        float angle_deg = angle * (180.0f / 3.14159265f); /* OLED display only */
        snprintf(buf, sizeof(buf), "SWEEP: %+5.1f deg", (double)angle_deg);
        oled_show_string_8x16_offset(1, 0, buf);
        HAL_Delay(SELFTEST_SERVO_SWEEP_HOLD_MS);
    }
}

/* Verification hold: commands the servo straight to the firmware-clamped
 * left max, holds it for SELFTEST_SERVO_HOLD_MEASURE_MS (long enough to
 * measure with a protractor), then straight to the right max, holds again -
 * no sweeping through intermediate steps, just the two operating extremes
 * (SERVO_ANGLE_MAX_LEFT_RAD/RIGHT_RAD, servo.h) for direct re-measurement
 * of the real steering angle at exactly what the firmware actually clamps
 * to. See docs/stm32/control_loop.md ("Servo range"). */
#define SELFTEST_SERVO_HOLD_MEASURE_MS 8000U
static void servo_sweep(void)
{
    /* Direct jumps (no intermediate stepping): center -> left max -> center
     * -> right max -> center, holding each long enough to measure with a
     * protractor. Bounds come from servo.h (SERVO_ANGLE_MAX_LEFT/RIGHT_RAD)
     * - this unit's own hardware-measured real limits, see servo.h/
     * docs/stm32/tuning.md. Positive = left, negative = right - confirmed
     * on physical hardware, see servo.h's sign-convention note. */
    oled_show_string_8x16_offset(1, 0, "LEFT MAX - HOLD");
    servo_set_angle(SERVO_ANGLE_MAX_LEFT_RAD);
    HAL_Delay(SELFTEST_SERVO_HOLD_MEASURE_MS);

    oled_show_string_8x16_offset(1, 0, "CENTER");
    servo_set_angle(0.0f);
    HAL_Delay(500);

    oled_show_string_8x16_offset(1, 0, "RIGHT MAX - HOLD");
    servo_set_angle(-SERVO_ANGLE_MAX_RIGHT_RAD);
    HAL_Delay(SELFTEST_SERVO_HOLD_MEASURE_MS);

    servo_set_angle(0.0f);
    HAL_Delay(300);
}

/* ------------------------------------------------------------------------
 * RAW-PULSE CALIBRATION (microseconds, button-advanced)
 *
 * Preferred tool for finding the real mechanical steering limits and for
 * protractor work, in place of the angle-based sweeps below. Rationale in
 * full at servo.h's servo_set_pulse_us() docs; the short version:
 *
 *   - Microseconds is the only unit here that is physically meaningful on
 *     its own. The angle sweeps' unit is an input to WHEELTEC's borrowed
 *     cubic, which is the very mapping being validated - measuring against
 *     it would be circular.
 *   - The angle path clamps at 800-2200us, and the cubic reaches 2200us at
 *     only ~-25.6deg commanded. Angle sweeps past that point send an
 *     identical pulse and cannot move the servo, so the previously recorded
 *     "right stall at 26deg" tells us nothing about the linkage. This path
 *     uses the wider SERVO_CAL_PULSE_MIN/MAX_US (600-2400us) instead.
 *   - The cubic's slope varies ~3x across the range, so equal angle steps
 *     are unequal physical steps. Equal microsecond steps are uniform.
 *
 * Advance is one step per PE0 press, so measuring is self-paced rather than
 * racing a fixed delay. If no press arrives within
 * SELFTEST_CAL_STEP_TIMEOUT_MS the sweep aborts and recenters - deliberate,
 * so a servo that has hit a stall is never left sitting loaded and drawing
 * current while unattended.
 * --------------------------------------------------------------------- */

/* Per-step wait before a limit/measure sweep gives up and recenters. Those
 * sweeps may be sitting against a stalled servo, so giving up promptly is the
 * safe default. The center trim does not use this - it holds position
 * indefinitely instead, see servo_cal_center_trim(). */
#define SELFTEST_CAL_STEP_TIMEOUT_MS 30000U

/* --- Center trim: find the pulse width that actually rolls straight ---
 *
 * 1500us is the nominal mechanical center but has never been verified. With
 * the motors off and the car pushed by hand it curves RIGHT, which isolates
 * the fault to steering geometry - no motor or PID contribution is possible
 * in that test. Curving right means true straight-ahead sits at a SHORTER
 * pulse than 1500 (shorter = left on this unit, per the measured endpoints:
 * 840us at +35deg left, 2400us at -29.5deg right), so this sweeps downward.
 *
 * 5us steps are ~0.27deg of real wheel angle each (left-side resolution is
 * 0.053deg/us), fine enough to land on straight without being tedious. If the
 * whole range is exhausted while it still curves right, lower
 * SELFTEST_TRIM_END_US further.
 *
 * Each step is HELD indefinitely - no timeout, no auto-recenter - so the car
 * can be pushed repeatedly at one setting and power cut at the good one. */
#define SELFTEST_TRIM_START_US 1500U
#define SELFTEST_TRIM_END_US   1430U
#define SELFTEST_TRIM_STEP_US     5U

/* --- Phase A: mechanical limit finding, one side at a time ---
 *
 * Each side starts at a pulse already known to be safe and steps OUTWARD in
 * small increments, so the first thing that ever goes wrong is the limit
 * being looked for. Note both sides move AWAY from 1500us but in opposite
 * numerical directions: the cubic's slope is negative, so left is a
 * shortening pulse and right a lengthening one.
 *
 * LEFT: 887us was the old operating clamp and 866us was observed moving
 * cleanly, with wheel-to-chassis contact appearing by ~809us. Starting at
 * 950us leaves a margin inside all of that. The expected outcome here is
 * chassis contact, not a stall.
 *
 * RIGHT: genuinely unknown territory. 2144us was the old clamp, and
 * everything beyond ~2200us was previously unreachable because the angle
 * path clamped there - so the old "stall" was the firmware, not the
 * hardware. Sweeping to 2400us (SERVO_CAL_PULSE_MAX_US) covers the rest of
 * the conventional RC envelope. A real stall may well appear partway; stop
 * there and record it. */
#define SELFTEST_CAL_LEFT_START_US   950U
#define SELFTEST_CAL_LEFT_END_US     780U
#define SELFTEST_CAL_LEFT_STEP_US     10U

/* Right range narrowed to the unexplored top end: 2400us was already reached
 * with the wheel still tracking (29.5deg real), so the interesting region is
 * above it. Starts at 2380us to give one known-good step for reference
 * before entering new territory, and ends at SERVO_CAL_PULSE_MAX_US.
 *
 * WHAT TO LOOK FOR HERE - the question is specifically whether the wheel
 * still MOVES as the pulse grows:
 *   - angle keeps increasing  -> still not at any limit
 *   - angle stops changing, servo silent -> servo's internal travel limit,
 *     a real and acceptable answer for this side
 *   - audible buzz/whine, no motion -> stall against a hard stop; back off
 *     immediately, do not hold it there
 *   - visible binding/scraping -> linkage or chassis contact
 * Compare the angle at 2380 against 2500. If they are the same, the pulse
 * has stopped buying travel and this side's real maximum is whatever that
 * angle is. */
#define SELFTEST_CAL_RIGHT_START_US 2380U
#define SELFTEST_CAL_RIGHT_END_US   2500U
#define SELFTEST_CAL_RIGHT_STEP_US    10U

/* --- Phase B: protractor measurement across the full range ---
 *
 * Run only AFTER phase A, and edit these bounds to sit just inside the
 * limits it found - the defaults are placeholders based on the old clamps,
 * not measured values. Coarse steps on purpose: the goal is a dozen or so
 * (pulse, real angle) pairs to fit a mapping to, and manual protractor
 * precision is far coarser than the 1us the timer can resolve, so finer
 * steps would only add reading noise. The range is swept in one continuous
 * pass through center rather than per-side, which keeps every reading on
 * the same protractor setup. */
#define SELFTEST_CAL_MEASURE_START_US  900U
#define SELFTEST_CAL_MEASURE_END_US   2200U
#define SELFTEST_CAL_MEASURE_STEP_US   100U

