Alvin0523/mdp_stm32/src/selftest.c
/* Blocks until PE0 is pressed, or until timeout_ms elapses since entry.
 * Returns 1 on press, 0 on timeout.
 *
 * Waits for release before arming, so holding the button down advances one
 * step rather than running away through the whole sweep. Also drains
 * button.c's EXTI0 self-test request flag: every press here would otherwise
 * still be latched when this returns, and main.c's loop would immediately
 * re-run the entire self-test on seeing it. */
static uint8_t wait_for_button_press(uint32_t timeout_ms)
{
    const uint32_t start_tick = HAL_GetTick();

    while (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == GPIO_PIN_RESET) {
        if (HAL_GetTick() - start_tick > timeout_ms) {
            (void)button_consume_selftest_request();
            return 0;
        }
        HAL_Delay(10);
    }

    while (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) != GPIO_PIN_RESET) {
        if (HAL_GetTick() - start_tick > timeout_ms) {
            (void)button_consume_selftest_request();
            return 0;
        }
        HAL_Delay(10);
    }

    HAL_Delay(40); /* contact debounce */
    (void)button_consume_selftest_request();
    return 1;
}

/* Steps the pulse width from start_us to end_us in step_mag_us increments,
 * one step per PE0 press. Direction is auto-detected from start vs. end.
 * Returns 1 if the full range was covered, 0 if aborted on timeout.
 *
 * The OLED shows the absolute pulse width and its signed offset from the
 * 1500us center - the offset is what makes left/right symmetry directly
 * comparable, which the commanded-angle numbers obscure (48deg vs 24deg
 * look wildly asymmetric while being only 613us vs 644us off center).
 *
 * WATCH AND LISTEN at every step. Two different limits present differently:
 *   - servo stall: audible buzz/whine, no visible movement
 *   - linkage/chassis contact: knuckle or wheel visibly binding or
 *     scraping while the servo is still trying
 * Stop at the LAST step that moved cleanly - that step is the limit, not
 * the one that stalled. */
static uint8_t servo_pulse_sweep(uint16_t start_us, uint16_t end_us,
                                 uint16_t step_mag_us, const char *label,
                                 uint32_t step_timeout_ms)
{
    char buf[20];
    const int32_t center_us = (int32_t)servo_pulse_center_us();
    const int32_t step = (end_us >= start_us) ? (int32_t)step_mag_us
                                             : -(int32_t)step_mag_us;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, label);
    oled_show_string_8x16_offset(3, 0, "PE0=next step");

    for (int32_t pulse = (int32_t)start_us;
         (step > 0) ? (pulse <= (int32_t)end_us) : (pulse >= (int32_t)end_us);
         pulse += step) {
        servo_set_pulse_us((uint16_t)pulse);

        /* Read back rather than echoing the request, so a value silenced by
         * SERVO_CAL_PULSE_MIN/MAX_US is visible instead of misleading. */
        const int32_t actual = (int32_t)servo_get_pulse_us();

        snprintf(buf, sizeof(buf), "PULSE %4ld us", (long)actual);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "CTR   %+4ld us", (long)(actual - center_us));
        oled_show_string_8x16_offset(2, 0, buf);

        if (!wait_for_button_press(step_timeout_ms)) {
            servo_set_pulse_us((uint16_t)center_us);
            oled_show_string_8x16_offset(1, 0, "TIMEOUT-CENTER  ");
            oled_show_string_8x16_offset(2, 0, "                ");
            HAL_Delay(1000);
            return 0;
        }
    }

    servo_set_pulse_us((uint16_t)center_us);
    oled_show_string_8x16_offset(1, 0, "RANGE DONE      ");
    oled_show_string_8x16_offset(2, 0, "                ");
    HAL_Delay(800);
    return 1;
}

static void servo_cal_left_limit(void)
{
    (void)servo_pulse_sweep(SELFTEST_CAL_LEFT_START_US, SELFTEST_CAL_LEFT_END_US,
                            SELFTEST_CAL_LEFT_STEP_US, "LEFT LIMIT",
                            SELFTEST_CAL_STEP_TIMEOUT_MS);
}

static void servo_cal_right_limit(void)
{
    (void)servo_pulse_sweep(SELFTEST_CAL_RIGHT_START_US, SELFTEST_CAL_RIGHT_END_US,
                            SELFTEST_CAL_RIGHT_STEP_US, "RIGHT LIMIT",
                            SELFTEST_CAL_STEP_TIMEOUT_MS);
}

static void servo_cal_measure(void)
{
    (void)servo_pulse_sweep(SELFTEST_CAL_MEASURE_START_US, SELFTEST_CAL_MEASURE_END_US,
                            SELFTEST_CAL_MEASURE_STEP_US, "MEASURE",
                            SELFTEST_CAL_STEP_TIMEOUT_MS);
}

/* Center trim. Steps the pulse DOWN by SELFTEST_TRIM_STEP_US on each PE0
 * press, starting at 1500us, and HOLDS whatever it is on indefinitely.
 *
 * Deliberately does NOT reuse servo_pulse_sweep(): that recenters both on
 * per-step timeout and at the end of its range, which would throw away the
 * very position being hunted for. Here there is no timeout at all - the servo
 * simply stays put until the next press, so the car can be pushed by hand as
 * many times as needed at each step, and power can be cut at the step that
 * rolls straight to leave the wheels sitting there.
 *
 * Motors stay off for this: a hand push removes the motors and PID from the
 * picture entirely, so anything left over is steering geometry.
 *
 * Read the held pulse off the OLED. It becomes SERVO_PULSE_CENTER_US in
 * servo.c, and both per-side slope constants recompute from it automatically
 * since they are derived from the center-to-lock spans.
 *
 * NOTE: this never returns on its own. Once the range bottoms out it holds
 * the last value forever, waiting on a button that no longer does anything -
 * reset the board to get out. That is the intended way to use it (cut power
 * at the step you want), but it does mean the robot is parked in calibration
 * mode until reset. */
static void servo_cal_center_trim(void)
{
    char buf[20];
    int32_t pulse = (int32_t)SELFTEST_TRIM_START_US;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "CENTER TRIM");
    oled_show_string_8x16_offset(3, 0, "PE0=-5us PUSH");

