Alvin0523/mdp_stm32/src/selftest.c
    for (;;) {
        servo_set_pulse_us((uint16_t)pulse);

        snprintf(buf, sizeof(buf), "PULSE %4u us", (unsigned)servo_get_pulse_us());
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "CTR   %+4ld us",
                 (long)((int32_t)servo_get_pulse_us() - (int32_t)servo_pulse_center_us()));
        oled_show_string_8x16_offset(2, 0, buf);

        /* No timeout - hold this position until the button is pressed. */
        (void)wait_for_button_press(0xFFFFFFFFU);

        if (pulse - (int32_t)SELFTEST_TRIM_STEP_US >= (int32_t)SELFTEST_TRIM_END_US) {
            pulse -= (int32_t)SELFTEST_TRIM_STEP_US;
        } else {
            /* Bottom of the range and still curving right - hold here rather
             * than wrapping or recentering, and widen SELFTEST_TRIM_END_US. */
            oled_show_string_8x16_offset(3, 0, "END-LOWER RANGE");
        }
    }
}

/* --- Recorded (pulse, real angle) data points, for re-measurement ---
 *
 * Every angle here is a REAL protractor reading at the wheel, NOT the
 * "commanded" value the servo_set_angle*() functions take. That distinction
 * is the entire point: at 840us the cubic's commanded angle is 52.3deg while
 * the wheel actually sits at 35.0deg, so the commanded unit overstates
 * reality by roughly 1.5x and must never be recorded as if it were an angle.
 *
 * OPEN QUESTION on both entries below: WHICH WHEEL the protractor was on was
 * not recorded, and that single omission is what stops these two numbers
 * from being usable. It is not a bookkeeping nicety - it plausibly accounts
 * for the entire 35.0 vs. 29.5deg gap:
 *
 * One servo drives both front wheels through a shared tie-rod, so a given
 * physical wheel is the INNER wheel in one turn direction and the OUTER
 * wheel in the other. Ackermann geometry deliberately steers the inner wheel
 * harder than the outer. Measuring the same wheel at both locks therefore
 * yields an inner-wheel angle for one direction and an outer-wheel angle for
 * the other, and a several-degree difference between those is the mechanism
 * working correctly - not a left/right asymmetry.
 *
 * So 35.0 vs. 29.5deg may be inner-vs-outer rather than left-vs-right. Until
 * both wheels are measured at both locks, that cannot be told apart, and
 * mdp_description's URDF (which wants left_joint and right_joint separately)
 * cannot be updated either way. Four readings settle it:
 *   left lock  -> left wheel (inner),  right wheel (outer)
 *   right lock -> right wheel (inner), left wheel (outer) */
typedef struct {
    uint16_t    pulse_us;
    float       measured_deg; /* real wheel angle previously read here */
    const char *label;
} servo_cal_point_t;

static const servo_cal_point_t s_servo_cal_points[] = {
    {  840U, 35.0f, "LEFT  840" },  /* left mechanical limit (chassis contact) */
    { 2400U, 29.5f, "RIGHT 2400" }, /* NOT a confirmed limit - this was the old
                                     * SERVO_CAL_PULSE_MAX_US ceiling, and the
                                     * wheel was still tracking when it was
                                     * reached. See PHASE 2. */
};

/* Drives to each recorded point in turn, button-advanced, showing the pulse
 * alongside the angle previously measured there so the protractor reading
 * can be compared on the spot. Disagreement is itself the result worth
 * having - it would mean the earlier reading, the wheel identification, or
 * center calibration is off.
 *
 * Uses servo_set_pulse_us(), so the SERVO_ANGLE_MAX_LEFT/RIGHT_RAD operating
 * clamp does not apply - 840us is well outside it. Bounded only by
 * SERVO_CAL_PULSE_MIN/MAX_US. */
static void servo_cal_verify_points(void)
{
    char buf[20];
    const uint16_t center_us = servo_pulse_center_us();
    const uint8_t n = (uint8_t)(sizeof(s_servo_cal_points) / sizeof(s_servo_cal_points[0]));

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "VERIFY POINTS");
    oled_show_string_8x16_offset(3, 0, "PE0=next point");

    for (uint8_t i = 0; i < n; i++) {
        servo_set_pulse_us(s_servo_cal_points[i].pulse_us);

        snprintf(buf, sizeof(buf), "%-11s", s_servo_cal_points[i].label);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "WAS %+5.1f deg", (double)s_servo_cal_points[i].measured_deg);
        oled_show_string_8x16_offset(2, 0, buf);

        if (!wait_for_button_press(SELFTEST_CAL_STEP_TIMEOUT_MS)) {
            servo_set_pulse_us(center_us);
            oled_show_string_8x16_offset(1, 0, "TIMEOUT-CENTER  ");
            oled_show_string_8x16_offset(2, 0, "                ");
            HAL_Delay(1000);
            return;
        }
    }

    servo_set_pulse_us(center_us);
    oled_show_string_8x16_offset(1, 0, "POINTS DONE     ");
    oled_show_string_8x16_offset(2, 0, "                ");
    HAL_Delay(800);
}

/* Fine sweeps past the current operating clamp on each side, to find this
 * unit's real mechanical lock point - see docs/stm32/tuning.md. Uses
 * servo_set_angle_raw() to bypass the operating clamp (still bounded by
 * the hard PWM safety clamp in servo.c). WATCH/LISTEN while running: the
 * last angle with clean, unobstructed motion is the real limit - a stall
 * sounds like an audible buzz/whine with no visible motion, or the
 * knuckle visibly binding/scraping before the servo horn itself stops. */
static void servo_sweep_right_fine(void)
{
    servo_sweep_range(SELFTEST_SERVO_RIGHT_FINE_START_RAD, SELFTEST_SERVO_RIGHT_FINE_END_RAD,
                       "RIGHT FINE -22..-40", 1);
    servo_set_angle(0.0f);
    HAL_Delay(300);
}

static void servo_sweep_left_fine(void)
{
    servo_sweep_range(SELFTEST_SERVO_LEFT_FINE_START_RAD, SELFTEST_SERVO_LEFT_FINE_END_RAD,
                       "LEFT FINE 40-55", 1);
    servo_set_angle(0.0f);
    HAL_Delay(300);
}

/* Drives straight with steering centered, THROUGH THE PID LOOP - unlike
 * drive_ticks() above, which writes open-loop PWM with the loop paused and so
 * cannot test it.
 *
 * Displays both wheels' encoder-measured rad/s live against the target, which
 * is the diagnostic that matters here: if the two measured values sit near
 * the target and near each other but the car still curves, the PID is doing
 * its job and the fault is elsewhere (steering center, or unequal effective
 * wheel radius, which an encoder cannot see). If the measured values differ
 * from the target or from each other, the loop itself is not tracking and the
 * untuned MOTOR_PID_KP/KI are the place to look.
 *
 * Encoder deltas are NOT read here - the PID ISR is their sole consumer while
 * running, so this uses motor_pid_get_measured_rad_s() and times out on the
 * clock rather than counting ticks. */
static void servo_straight_line_pid(void)
{
    char buf[20];
    float left_rad_s = 0.0f, right_rad_s = 0.0f;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "STRAIGHT PID");

