Alvin0523/mdp_stm32/src/selftest.c
    servo_set_angle(0.0f); /* real angle now - 0 maps to the measured center */
    HAL_Delay(400);

    motor_pid_resume(); /* selftest_run() paused it on entry */
    motor_pid_enable(1);
    motor_pid_set_target(SELFTEST_STRAIGHT_RAD_S, SELFTEST_STRAIGHT_RAD_S);

    const uint32_t start_tick = HAL_GetTick();
    while (HAL_GetTick() - start_tick < SELFTEST_STRAIGHT_MS) {
        motor_pid_get_measured_rad_s(&left_rad_s, &right_rad_s);

        snprintf(buf, sizeof(buf), "TGT %4.1f rad/s", (double)SELFTEST_STRAIGHT_RAD_S);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "L%4.1f  R%4.1f", (double)left_rad_s, (double)right_rad_s);
        oled_show_string_8x16_offset(2, 0, buf);

        HAL_Delay(100);
    }

    motor_pid_set_target(0.0f, 0.0f);
    HAL_Delay(300);
    motor_pid_enable(0);
    motor_pid_pause();
    motor_set_speed(0, 0);

    oled_show_string_8x16_offset(1, 0, "STRAIGHT DONE   ");
    oled_show_string_8x16_offset(2, 0, "                ");
    HAL_Delay(500);
}

void selftest_run_if_requested(void)
{
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) != GPIO_PIN_RESET) {
        return; /* PE0 not held (pull-up idles high, pressed = low) */
    }

    selftest_run();
}

void selftest_run(void)
{
    if (motor_estop_engaged()) {
        blink_pe8(5, 100, 100); /* refused */
        return;
    }

    /* This whole sequence drives motors and reads encoder deltas directly
     * - the PID loop's TIM7 ISR (motor.c, docs/stm32/control_loop.md) does
     * both of those every 10ms in the background and would otherwise fight
     * us for the motors and steal our encoder ticks. */
    motor_pid_pause();

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "SELF-TEST MODE");

    /* Phases 1/2 (forward/backward 1 wheel revolution) disabled - right-
     * side-only servo measurement pass. Commented out, not deleted.
     *
     * blink_pe8(1, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "1: FWD 1 REV");
     * drive_ticks(SELFTEST_DRIVE_PCT, SELFTEST_TICKS_PER_REV);
     *
     * blink_pe8(2, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "2: REV 1 REV");
     * drive_ticks(-SELFTEST_DRIVE_PCT, SELFTEST_TICKS_PER_REV);
     */

    /* The angle-based fine sweeps are superseded by the raw-pulse
     * calibration phases below and kept only for reference. Do not use them
     * to find limits: their unit is an input to the unverified cubic, and
     * their 800-2200us clamp is what made the right side unmeasurable in
     * the first place (see the RAW-PULSE CALIBRATION block above).
     *
     * servo_sweep_left_fine();
     * servo_sweep_right_fine();
     */

    /* Routine both-extremes verification hold. Disabled during calibration
     * because it drives to SERVO_ANGLE_MAX_LEFT/RIGHT_RAD, whose provenance
     * is exactly what is under question - restore it once the limits below
     * have been measured and those constants updated.
     *
     * blink_pe8(1, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "1: SERVO SWEEP");
     * servo_sweep();
     */

    /* PHASE 1 - straight line through the PID loop. Needs floor space and the
     * motor switch on. Steering is centered via servo_set_angle(0.0f), which
     * now resolves to the MEASURED 1490us center rather than the nominal
     * 1500us that curved right. */
    blink_pe8(1, 150, 150);
    servo_straight_line_pid();

    /* Center trim - done, 1490us is now SERVO_PULSE_CENTER_US in servo.c.
     * Re-enable only to re-trim; note it never returns on its own (holds each
     * step indefinitely so power can be cut at the chosen one).
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_center_trim();
     */

    /* Steering calibration phases - both sides measured already (left 840us
     * /35.0deg, right 2400us/29.5deg), so they are off by default. Re-enable
     * servo_cal_verify_points() to re-check those points (measuring BOTH
     * front wheels this time, per s_servo_cal_points), or
     * servo_cal_right_limit() to sweep 2380-2500us and see whether the right
     * side extends past the 2400us currently taken as its limit.
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_verify_points();
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_right_limit();
     */

    /* Left limit found at 840us (35.0deg real, chassis contact) - re-enable
     * only to re-check that side.
     *
     * servo_cal_left_limit();
     */

    /* PHASE B - protractor measurement across the full range. Enable once
     * both limits are known, after narrowing SELFTEST_CAL_MEASURE_START/END_US
     * to sit inside them.
     *
     * blink_pe8(3, 150, 150);
     * servo_cal_measure();
     */

    /* Return to center and finish */
    servo_set_angle(0.0f);
    oled_show_string_8x16_offset(1, 0, "DONE            ");
    blink_pe8(2, 80, 80);

    motor_pid_resume();
}
